Revit 2024 API
Solid.ComputeCentroid Method
Returns the Centroid of this solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ ComputeCentroid()
Visual Basic
Public Function ComputeCentroid As XYZ
Visual C++
public:
XYZ^ ComputeCentroid()
Return Value
The XYZ point of the Centroid of this solid.
Remarks
 Calculates the centroid of the solid using an approximation, with an accuracy suitable for architectural purposes. This will correspond only with the center of gravity if the solid represents a homogeneous structure of a single material.
See Also
Solid Class
Autodesk.Revit.DB Namespace